var t, e, o, s, i, l, n, a, c, x, m;

module.exports = {
    privacy_policy: {
        name: "privacy_policy",
        title: "隐私政策",
        open: !1,
        content: null,
        detailContent: [ {
            middleTittle: {
                text: "上海罗烁贸易有限公司（“公司”）致力于保护您的隐私。我们已制定本隐私政策，向您描述我们的网站（“网站”）（包括通过移动设备、移动应用程序或其他途径使用我们的任何服务，除非另有说明）收集用户的个人数据（定义如下）。结合本隐私政策，您还应查看我们的销售条款，以更全面地了解关于我们网站、产品和服务的规则。",
                color: "black"
            },
            contentInfo: [ {
                smallTittle: (t = {
                    text: ""
                }, t.text = "1.联系公司。", t),
                contentDes: [ "如果您对我们的隐私政策或我们的数据收集或处理方法有任何问题、疑虑或投诉，或者您想向我们报告任何安全违规行为，请通过以下地址或电话号码与我们联系：service@rothys.com.cn" ]
            }, {
                smallTittle: (e = {
                    text: ""
                }, e.text = "2.用户同意。", e),
                contentDes: [ "通过我们的网站或服务提交个人数据，即表示您同意本隐私政策的条款，并且您明示同意根据本隐私政策对您的个人数据的收集、使用和披露。" ]
            }, {
                smallTittle: (o = {
                    text: ""
                }, o.text = "3.我们收集的数据类型。", o),
                contentDes: [ "“个人数据”是指可以识别个人信息或联系您的数据，包括您的姓名、地址、电话号码、电子邮件地址以及与前述数据相关联或相联系的您的任何其他非公开信息。“匿名数据”是指与您的个人数据无关系或无关联的数据；匿名数据本身不允许对个人身份进行识别。我们根据以下规定收集个人数据和匿名数据。" ]
            }, {
                smallTittle: (s = {
                    text: ""
                }, s.text = "4.您向我们提供的信息。", s),
                contentDes: [ "· 当您创建帐户（“帐户”）以登录我们的网站时，我们可能会收集您的个人数据，例如您的姓氏、名字、电子邮件和地址、公司名称、生日、鞋码和密码。", "", "· 如果您使用通过第三方登陆服务（如微信等）创建帐户，我们将访问并收集根据您在该第三方服务上的隐私设置所允许我们访问的信息，以便我们为您创建帐户。", "", "· 如果您在移动设备上使用我们的服务，我们可能会收集您的电话号码和唯一设备识别码。", "", "· 我们的网站允许您存储偏好设置，例如您的内容显示方式、您的位置和安全检索设置。我们可能会将这些选项与您的账号、浏览器或移动设备相关联，并且您可以随时编辑这些偏好设置。", "", "· 如果您有兴趣接收即将来临的销售、活动和其他促销的信息，我们也可能会要求您提供某些个人信息。", "", "· 我们为您保留信息，例如您使用您的帐户存储的文件和消息。", "", "· 如果您向我们提供反馈，或者您通过电子邮件联系我们或我们的客户支持团队，我们将收集您的姓名和电子邮件地址，以及电子邮件中包含的任何其他内容，以便向您发送回复。", "", "· 当您参与我们的某项调查时，我们可能会收集其他资料信息。", "", "· 如果您参加我们网站上的抽奖、竞赛或赠品活动，我们可能会要求您提供您的电子邮件地址和/或家庭电话号码（以向您通知您是否中奖）。我们也可能要求您提供名字和姓氏，有时还要求您提供地址和其他信息，以验证您的身份。在某些情况下，我们可能需要其他信息作为参与程序的一部分，例如奖品选择。这些抽奖和竞赛是自愿的。我们建议您阅读您参与的每个抽奖活动和比赛的规则。", "", "· 我们还可能在我们网站的其他说明了个人数据正在被收集的位置收集个人数据。" ]
            }, {
                smallTittle: (i = {
                    text: ""
                }, i.text = "5.通过技术收集的信息。", i),
                contentDes: [ "· 我们的服务器收集的信息。为了使我们的网站对您更有用，我们（可能由第三方服务提供商托管）的服务器会收集您的信息，包括您的浏览器类型、操作系统、互联网协议（“IP”）地址（在您使用互联网时自动分配到您的电脑上、可能会因会话而异的一串数字）、域名和/或您的访问日期/时间信息。", "", "· 日志文件。与大多数网站一样，我们会自动收集某些信息并将其存储在日志文件中。此信息包括IP地址、浏览器类型、互联网服务提供商（“ISP”）、转引/退出页面、操作系统、日期/时间戳和点击流数据。我们使用这些信息来分析趋势、管理网站、跟踪用户在网站附近的活动、收集有关我们用户群的人口统计信息，并根据我们用户的需求更好地定制我们的服务。例如，一些信息可能被收集以便当您再次访问网站或服务时能够被识别，并且该信息可进而用于向您提供适合您兴趣的广告和其他信息。除非本隐私政策中另有说明，否则我们不会将此自动收集的数据与个人数据相关联。", "", "· Cookies。像许多在线服务一样，我们使用Cookies（“Cookies”）来收集信息。Cookies是在您查看网站时发送到计算机硬盘的一小段信息。我们可能会使用会话Cookies（一旦您关闭您的网络浏览器即到期）和永久Cookies（在您删除它们之前会一直保留在您的计算机上），以便在我们的网站上为您提供更加个性化和交互式的体验。收集此类信息是为了使本网站对您更有用及更便捷，并根据您的特殊兴趣和需求量身定制体验。", "", "· 像素标签。此外，我们使用像素标签（“Pixel Tags”）（也被称为净图像档、网站信标或网络爬虫）。像素标签是具有唯一标识符的微小的图形图像，其功能类似于Cookies，用于跟踪网络用户的在线移动。与存储在用户计算机硬盘上的Cookies不同，像素标签无形地嵌入在网页中。像素标签还允许我们以用户可以阅读的格式发送电子邮件，并告诉我们电子邮件是否已被打开，以确保我们仅发送用户感兴趣的邮件。我们可能会使用此信息来减少或消除发送给用户的消息。我们不会将像素标签收集的信息与用户的个人数据联系起来。", "", "· 我们如何回应不追踪信号（Do Not Track Signals）。我们目前不回应“不追踪”信号或其他可能使用户选择不在我们网站上被追踪的机制。", "", "· Flash LSOs。当我们发布视频时（如有），第三方可能会使用本地共享对象（被称为“Flash Cookie”）来存储您的音量控制偏好或个性化某些视频功能。Flash Cookies与浏览器Cookies不同，因为数据的数量和类型以及数据的存储方式不同。您的浏览器提供的Cookies管理工具不会删除Flash Cookies。要了解如何管理Flash Cookies的隐私和存储设置，请点击此处：http://www.macromedia.com/support/documentation/en/flashplayer/help/settings_manager07.html。", "", "· 基于兴趣的广告。除了使用上述Cookies和相关技术外，我们还可能允许第三方帮助我们定制我们认为用户可能会感兴趣的广告，并收集和使用有关我们网站上用户活动的其他数据（例如，允许它们在第三方服务上定制广告）。这些公司可能会投放可能放置Cookies并以其他方式追踪用户行为的广告。如果您不希望我们与使用追踪技术的公司分享信息以便根据此类信息提供有针对性的展示广告，您可以通过访问http://www.aboutads.info/或http://networkadvertising.org/choices/来选择退出此功能。", "", "· 分析服务和基于兴趣的广告。除了我们放置的追踪技术，其他公司可以在您访问我们的网站时设置自己的Cookies或类似的工具。这包括我们参与其中以帮助分析用户使用本网站方式的第三方分析服务（“分析服务”），以及提供内容或优惠的第三方。我们可能会收到这些服务提供方以个人或整体为基础使用这些数据生成的报告。我们仅使用从分析服务提供商获取的信息来改进我们的网站和服务。Cookies或其他技术生成的有关您使用我们的网站和服务的信息（“分析信息”）会传输到分析服务提供商。分析服务提供商使用分析信息编译有关用户活动的报告。如果法律要求，或者由第三方代表其处理分析信息，分析服务提供商也可能会将信息传输给第三方。每项分析服务使用和共享分析信息的能力均受该分析服务使用条款和隐私权政策的限制。使用我们的网站和服务，即表示您同意分析服务提供商以上述方式和目的处理您的数据。" ]
            }, {
                smallTittle: (l = {
                    text: ""
                }, l.text = "6.从您处收集的关于他人的信息。", l),
                contentDes: [ "· 如果您决定邀请第三方创建帐户，我们和我们的第三方服务提供商将在（表明该页面由我们的第三方服务提供商提供支持的）页面上收集您和第三方的姓名和电子邮件地址，以发送电子邮件并跟进您邀请的第三方。我们依赖您从第三方获得法律可能要求的任何同意，以允许我们和我们的第三方服务提供商如上所述访问和上传第三方的名称和电子邮件地址。您或第三方可以通过本隐私政策第1部分中列出的电话号码与我们联系，以要求从我们的数据库中删除该等信息。", "", "· 作为您使用服务的一部分，我们为您提供自动与您的朋友联系的机会。我们采用各种技术，以方便朋友们在我们的服务上找到对方，包括提供联系人导入工具以方便您添加您的联系人（例如我们的第三方服务提供商的导入联系人功能、微信好友和您的地址簿中的联系人），这样您就可以更方便地通过我们的服务请求您的联系人加入并与您沟通。经过您的许可，我们将访问您的地址簿、通话记录和/或短信日志，并导入您的联系人姓名、电子邮件地址、电话号码、图像、地理位置和/或社交网络账号（例如微信用户名）以便您与朋友自动连接。我们这样做仅用于联系人匹配，以帮助您的朋友和您找到对方。此外，当您邀请朋友加入服务时，我们将访问您的地址簿并导入您的联系人的姓名和电话号码，以方便邀请。发送给您朋友的电子邮件将来自您的电子邮件地址，以便您的朋友知道您想邀请他们访问网站。我们不会存储您在联系人导入过程中提供的任何密码。我们还会收集一些有助于我们解释您的数据的设置，例如您已建立的语言和键盘设置，以及手机的运营商、移动网络代码和移动国家/地区代码。" ]
            }, {
                smallTittle: (n = {
                    text: ""
                }, n.text = "7.从第三方公司收集的信息。", n),
                contentDes: [ "我们可能从其他第三方公司（包括联合品牌或私人标签网站方式提供我们产品的公司、帮助我们为您提供在我们网站上启用的服务的公司、或我们赞助了我们的产品作为竞赛奖品的公司）处收到您的个人和/或匿名数据。这些第三方公司可能会向我们提供个人数据。我们可能会将这些信息添加到我们已经通过我们的网站收集到的您的信息中，以便改进我们提供的服务。" ]
            }, {
                smallTittle: (a = {
                    text: ""
                }, a.text = "8.使用您的个人信息", a),
                contentDes: [ "○ 一般用途。一般而言，您提交给我们的个人数据用于回复您提出的请求，或帮助我们更好地为您服务。我们通过以下方式使用您的个人数据：", "", "· 向您推荐我们网站上的符合您尺寸的产品；", "", "· 改进网站上提供的产品（例如，决定是否提供更大或更小的尺寸）；", "", "· 与您分享信息，以确认您提供给我们的某些日期（例如，确认您的生日）；", "", "· 协助在我们的网络上创建和保护您的帐户；", "", "· 将您识别为我们系统中的用户；", "", "· 改进对我们网站和服务的管理；", "", "· 向您发送欢迎电子邮件，以验证您在创建账户时所提供的电子邮件地址的所有权；", "", "· 向您发送管理性电子邮件通知，例如安全性或支持和维护咨询；", "", "· 回应有关就业机会或其他要求的询问；", "", "· 在网站上、通过电子邮件或推送通知为您提供有针对性的优惠和广告，并就即将到来的销售、促销、优惠和产品信息与您联系。您可能会收到通过第三方网站和媒体（包括社交媒体）向您发送的广告优惠；和", "", "· 发送与我们的产品或公司其他营销目的相关的购买确认电子邮件、新闻通讯、调查、优惠和其他宣传材料。", "", "○ 用户推荐和反馈。我们经常收到对我们产品有积极体验的客户的推荐和评论。我们偶尔会发布这样的内容。当我们发布此类内容时，我们可能会用他们的名字和姓氏来识别我们的客户，也可能表明他们的家乡。我们在发布他们的名字以及推荐之前会获得客户的同意。我们可能会不时在网站上发布客户反馈。我们将仅分享您的反馈及您的名字和姓氏的首字母。如果我们选择在发布您的反馈意见的同时发布您的名字和姓氏，我们会在发布您的反馈意见之前征得您的同意。", "", "○ 创建匿名数据。我们可能通过从个人数据中排除可以识别个人身份的信息（例如您的姓名）来创建匿名数据记录。我们使用此匿名数据来分析请求和使用模式，以便我们可以增强服务内容并改进网站导航。我们保留出于任何目的使用匿名数据以及经汇总和其他去标识化的信息及自行决定向第三方披露匿名数据的权利。" ]
            }, {
                smallTittle: (c = {
                    text: ""
                }, c.text = "9.披露您的个人信息。", c),
                contentDes: [ "我们按以下规定及在本隐私政策中其他各处之规定披露您的个人信息。", "", "○ 第三方。我们可能会与第三方服务提供商共享您的个人数据，以便：通过我们的网站向您提供我们的产品和服务；进行质量保证检验；促进帐户的创建；提供技术支持；为您提供客户支持；理解您在网站上的行为；和/或向我们提供其他服务。", "", "○ 关联公司。我们可能会与我们的母公司、子公司、合资企业或共同控制下的其他公司（“关联公司”）共享您的部分或全部个人数据，在这种情况下，我们将要求我们的关联公司遵守本隐私政策。但是，某些第三方服务提供商对于我们需要为您的相关行为而向其提供的信息有自己的隐私政策。对于这些提供商，我们建议您阅读其隐私政策，以便了解这些提供商处理您的个人信息的方式。", "", "○ 媒体；社交媒体网站。我们还可能与第三方（如媒体）共享您的电子邮件地址，以使其代表我们向您发送包括基于兴趣的广告在内的电子邮件和其他通信。我们还可能会与我们的广告和营销合作伙伴以及第三方媒体（包括社交媒体网站）共享有关您的经汇总或去标识化的信息，包括基于您的电子邮件地址的信息，以便他们代表我们发送有针对性的广告信息。", "", "○ 企业重组。我们可能会就任何合并、融资、收购或解散的交易的谈判或涉及出售、转让、剥夺或披露我们全部或部分业务或资产而分享您的部分或全部个人数据。如果发生资不抵债、破产或接管，个人数据也可能作为商业资产而被转移。如果另一家公司收购了我们的公司、业务或资产，该公司将拥有我们收集的个人数据，并将承担本隐私政策中所述的有关您的个人数据的权利和义务。", "", "○ 社交平台。我们的某些服务可能使您能够将内容发布到社交平台（例如微信、QQ、微博、Facebook，Instagram，Twitter和/或Pinterest）上。如果您选择这样做，我们和我们的第三方服务提供商将根据您的选择向此类社交平台提供信息。您承认并同意您对使用这些平台负全部责任，并且您有责任查看此类社交平台的第三方提供商的使用条款和隐私政策。我们和我们的第三方服务提供商对以下事项不承担任何责任或义务：(i)此类社交平台的可用性或准确性；(ii)此类社交平台的内容、产品或服务或其内容、产品或服务的可用性；或(iii)您对任何此类社交平台的使用。", "", "○ 其他披露。无论您对个人数据做出何种选择（如下所述），如果公司善意地相信以下披露是必要的，则公司可以披露个人数据：(a)与任何法律调查有关；(b)为了遵守相关法律或回应公司收到的传票或搜查令；(c)为了保护或保卫公司或网站或服务的用户的权利或财产；和/或(d)为了调查或协助阻止任何对法律、本隐私政策或我们的服务条款协议的违反或可能违反。", "", "○ 第三方网站。我们的网站可能包含第三方网站的链接。当您点击任何其他网站或网址的链接时，您将离开我们的网站并跳转到另一个网站，而另一个实体可能会收集您的个人数据或匿名数据。我们对这些外部网站及其内容没有控制、不进行审查、也不能对其负责。请注意，在您点击此类外部网站的链接后，本隐私政策的条款不适用于这些外部网站或内容，也不适用于对您的任何个人数据的收集。我们鼓励您阅读您访问的每个网站的隐私政策。指向第三方网站或网址的链接仅为了您的方便，并不表示我们认可此类第三方或其产品、内容或网站。" ]
            }, {
                smallTittle: (x = {
                    text: ""
                }, x.text = "10.您关于信息的选择。", x),
                contentDes: [ "您有一些关于我们网站上的信息使用的选择。", "", "○ 电子邮件通讯。我们会定期向您发送直接宣传使用我们的网站或服务的免费新闻通讯和电子邮件。当您收到我们的新闻通讯或促销信息时，您可以表明愿意停止接收我们的进一步通信，您将有机会按照您收到的电子邮件中提供的取消订阅说明或直接联系我们（请参阅上述联系信息）“选择退出”。请注意，尽管您提供了指定的电子邮件偏好设置，但我们仍可能就您的订单或与我们和您进行的任何业务相关的任何问题与您联系，包括我们的服务条款协议或隐私政策的任何更新的通知。", "", "○ 如果您在任何时候决定不再希望接受我们服务中的Cookies用于前述的任何目的，那么您可以通过更改其设置指示您的浏览器停止接受Cookies或在接受您访问的网站的Cookies之前提示您。请参阅您的浏览器的技术信息。但是，如果您不接受Cookies，则可能无法使用本服务的全部部分或本服务的全部功能。", "", "○ 解除与社交平台的链接。如果您在任何时候决定不再希望将您的社交平台帐户（例如微信）链接到您的帐户，那么您可以在帐户设置的“偏好设置”中取消链接社交平台帐户。当您通过社交平台与我们关联时，您还可以管理与我们共享的某些个人数据。请参阅社交平台的隐私设置，以确定如何调整我们的权限并管理我们的服务与您的社交平台帐户或移动设备之间的交互性。", "", "○ 更改或删除您的个人数据。所有用户都可以通过本隐私政策第1部分中列出的联系信息与我们联系，以查看、更新、更正或删除其用户帐户（包括任何导入的联系人）中的个人数据。如果您完全删除了所有个人数据，那么您的用户帐户可能会被停用。我们将采取商业上合理的努力来满足您的要求。我们可能会根据法律要求或出于合法商业目的（包括但不限于定制广告或改善用户在网站上的体验）保留您的记录的存档副本。" ]
            }, {
                smallTittle: (m = {
                    text: ""
                }, m.text = "11.本隐私政策的变更。", m),
                contentDes: [ "本隐私政策可能因任何原因不时更新。我们将通过在隐私政策上发布新的隐私政策来通知您隐私政策的任何变更，我们将更改上述“更新日期”。您应该定期查阅本隐私政策以了解任何变更。如果我们对使用您的个人数据的方式进行任何重大更改，我们将通过向您提供给我们的最后一个电子邮件地址发送一封电子邮件来通知您和/或在我们的网站上突出显示该更改通知。对本隐私政策的任何更改将在 (i)我们向您发送电子邮件通知后的三十（30）个日历日后或 (ii)我们在网站上发布更改通知后的三十（30）个日历日后生效（二者以先到日期为准）。这些更改将对我们网站的新用户立即生效。请注意，您始终有责任更新您的个人数据以向我们提供您最新的电子邮件地址。如果您提供给我们的最后一个电子邮件地址无效，或由于任何原因无法向您发送上述通知，我们发送包含此类通知的电子邮件仍构成对该通知中所描述的变更的有效通知。在发生此类变更通知后继续使用我们的网站应表明您对此类变更的确认，并同意受此类变更后的条款和条件的约束。" ]
            } ]
        } ]
    },
    sales_conditions: {
        name: "sales_conditions",
        title: "销售条款",
        content: null,
        open: !1,
        detailContent: [ {
            contentInfo: [ {
                smallTittle: {
                    text: "关于价格"
                },
                contentDes: [ "划线价格：指商品的专柜价、吊牌价、正品零售价、厂商指导价或该商品的曾经展示过的销售价等，并非原价，仅供参考。", "未划线价格：指商品的实时标价，不因表述的差异改变性质。具体成交价格根据商品参加活动或使用优惠券等发生变化，以最终订单结算页的价格为准。" ]
            }, {
                smallTittle: {
                    text: "关于物流"
                },
                contentDes: [ "店铺使用顺丰快递，其中顺丰不可达地区支持EMS配送，店铺不接受指定快递。" ]
            }, {
                smallTittle: {
                    text: "关于退换货"
                },
                contentDes: [ "1.商品支持7天无理由退换货，由物流公司显示签收日起计算。除瑕疵品外，超出7天的退换货，我们将无法受理。", "2.退货商品必须未经穿着、无磨损、未经洗涤，必须仍是原购买时的状态，且商品包装完好配件齐全，不影响二次销售。", "3.若发生退货，需将赠品一同退回，否则退货会作拒收处理。", "4.退换货时，请将商品包装及附件全部寄回指定地址，需用白纸写明您的订单编号、退货商品名及件数、微信名和退货理由，以便能及时为您处理。" ]
            }, {
                smallTittle: {
                    text: "退换货邮费"
                },
                contentDes: [ "1.商品因质量问题导致产生退换货的邮费由卖家承担；", "2.商品因非质量问题导致产生退换货的邮费由买家承担。" ]
            } ]
        } ]
    }
};